In [8]:
import mysql.connector
from mysql.connector import Error
from db_connect import DB_CONFIG


def connect_to_database():
    global connection, cursor
    try:
        connection = mysql.connector.connect(
            host=DB_CONFIG['host'],
            database=DB_CONFIG['database'],
            user=DB_CONFIG['user'],
            password=DB_CONFIG['password']
        )

        if connection.is_connected():
            print("Successfully connected to the database")
            cursor = connection.cursor()

            cursor.execute("SHOW TABLES")
            tables = cursor.fetchall()
            print("Tables in the database:")
            for table in tables:
                print(table[0])

            return connection

    except Error as e:
        print(f"Error: {e}")

connect_to_database()

In [52]:
def search_query(query) :
    cursor.execute(query)
    rows = cursor.fetchall()
    data_list = []
    for row in rows :
        data_list.append([*row])
    return data_list

In [55]:
query = "SELECT * FROM auction_price_data ORDER BY date LIMIT 3"
search_query(query);

In [56]:
import pandas as pd
df = pd.DataFrame(search_query(query))
df

         0   1    2    3      4        5        6        7           8
0  (선)갑오징어  여수  10미  box    5.0  47500.0  47500.0  47500.0  2018-01-02
1   (선)깐홍합  여수    소  box  478.0   9000.0   3000.0   7200.0  2018-01-02
2   (선)간재미  군산    중   kg  425.0   2000.0    700.0    900.0  2018-01-02

In [6]:
if connection.is_connected():
    connection.close()
    print("MySQL connection is closed")

MySQL connection is closed